import discord
from discord.ext import commands

class AnnouncementCog(commands.Cog):
    def __init__(self, bot):
        self.bot = bot

    @commands.command(name='оголошення')
    async def announcement_command(self, ctx):
        """Команда для відображення оголошення про оновлення сервера"""
        
        embed = discord.Embed(
            title="<:marketing:1412519940807720960> Оновлення серверу",
            description="""**Відкритий набір в адміністрацію сервера**
Нам конче потрібен персонал для обслуговування серверу так як скоро він ще більше підросте, такі як <@&1386307351824568461> люди котрі займаються створенням івентів на сервері/проведення каток.

<:palka:1412777364387135589>  також якщо вас приймуть в адміністрацію ви можете отримати свою кастомну роль)))

<:palka:1412777364387135589> деталі ви можете дізнатись в <#1403682856814903368>

<:zirka:1412519774780395631> **Кастомні ролі**
Тепер ви можете отримати кастомні ролі за різноманітні досягнення на сервері а точніше процитую головне:

<:palka:1412777364387135589> **Інвайти** — запросити на сервер від 2 до 5 людей.

<:palka:1412777364387135589> **Мем/контент місяця** — якщо твій контент (мем, арт, відео) набрав найбільше реакцій на сервері, в кінці місяця буде проведено голосування чиє "мистецтво виграє". Щоб адмін не шукав ваше мистецтво — за день-два до голосування відмітьте його написавши "vote". **(По суті це поки адмін не зробить щоб бот це відстежував а поки як завжди терпі хохол роднєнькій)**

<:palka:1412777364387135589> **Внесок у сервер** — допоміг з розвитком (оформлення, ідеї, контент), за рішенням адміністрації.

<:kalendar:1412519787019501719> **Івенти на сервері**
З'явилися серверні івенти, ми будемо проводити їх час від часу тому слідкуйте щоб не пропустити в <#1412128329510944899>, деталі щодо правил та іншого можете глянути тут <#1412127891780669522>

<:palka:1412777364387135589> також і за івенти ви зможете отримати кастомні ролі

<:palka:1412777364387135589> зайняти призове місце в офіційному івенті сервера. (кастомка залишається рівно до слідуючого номінанта на призове місце в івенті від сервера)

<:palka:1412777364387135589> виграти 10 разів у івентах/іграх""",
            color=12370112  # Light gray color
        )
        
        await ctx.send(embed=embed)
        await ctx.send("@everyone")

# Setup function for the cog
async def setup(bot):
    await bot.add_cog(AnnouncementCog(bot))