import discord
from discord.ext import commands
from modules.db import get_database

db = get_database()

class RecruitmentCog(commands.Cog):
    def __init__(self, bot):
        self.bot = bot

    @commands.command(name='набір')
    async def recruitment_command(self, ctx):
        """Команда для відображення інформації про набір в адміністрацію"""
        
        # Створюємо embed для набору
        embed = discord.Embed(
            title="Набір вакансій:",
            color=0x36393F
        )
        
        # Встановлюємо зображення для набору
        embed.set_image(url="https://i.imgur.com/6RTM1Gw.png")
        
        embed.add_field(
            name="**Набір до Адміністрації серверу відкритий!**",
            value=f"""<@&1410532910989312000> — **адміністрація сервера.** Довірені особи власника серверу

<@&1404790445040472115> — **вища модерація сервера.** Наглядач за модераторами, також має право наглядати за сервером.

<@&1387889015159656528> — **модерація сервера.** Відповідає за порядок на сервері, стежить за дотриманням правил учасниками. Має право видавати попередження, тимчасові блокування та карати за порушення.

<@&1403092677162958878> — **нижча модерація сервера.** Допоміжна роль для підтримки учасників. Відповідає на питання користувачів, підказує щодо функціоналу сервера та допомагає модераторам у легких завданнях.

<@&1386307351824568461> — **ведучі заходів сервера.** Організатори івентів, конкурсів та розваг. Відповідають за проведення ігрових активностей, вікторин та подібних заходів, щоб урізноманітнити життя сервера.

<@&1404791155639455776> — **наглядачі за економікою сервера.** Відповідають за баланс і стабільність економічних систем сервера. Контролюють роботу ботів, перевіряють можливі баги, займаються відновленням справедливості у випадку зловживань.

<@&1403092677162958878> — **досвідчені учасники сервера.** Це люди, які давно перебувають на сервері та знають його від А до Я. Вони можуть допомогти новачкам зорієнтуватися, пояснити правила, підказати, як користуватися каналами чи економікою. Є опорою для спільноти, але не мають повноважень модерації.

**Звертайся в [підтримку](https://discord.com/channels/1386300362595504159/1403682856814903368)**""",
            inline=False
        )
        
        await ctx.send(embed=embed)

# Функція налаштування для кога
async def setup(bot):
    await bot.add_cog(RecruitmentCog(bot))